[
  {
    "name":"Skiing Oukaïmeden",
    "image_url":"n/a",
    "lat":"31.194752",
    "lng":"-7.855196",
    "description":"As one of Africa’s most northerly ski resorts, Oukaïmeden’s location in the High Atlas Mountains has been a fascinating skiing location for decades. The resort is located about 49 miles (78km) south of Marrakech and is the highest ski resort in Africa. Standing at over 3,000 metres (over 9,500 feet) and offering up to 10km of skiable slopes, visitors are a mix of both tourists and local skiers.<br><br>There are seven lifts in Oukaïmeden that run for all abilities, including six drag-lifts that service the beginner’s nursery slope and the intermediate-level slopes; and a slow single chairlift to the more advanced slope. The intermediate slopes are much more attractive and have fairly tamed conditions, but the difficulty of each run varies a lot depending on the hill. At the bottom of the lifts, you will find a well-kept nursery slope that provides a better environment for beginner’s-level skiing, together with a large family sledding area.<br><br>The resort offers a small selection of runs, with the longest being just over 2 miles (3km), and the runs from the top of the chairlift being the most challenging. This is where the snow can feel like hard off-piste ice in some sections as you descend. These runs are not particularly easy and are best suited to high-intermediate to advanced-level skiers.",
    "lift_breakdown":{
      "gondolasAndTrams":0,
      "trains":0,
      "chairlifts":1,
      "surface":6
    },
    "lifts_total":"7",
    "runs_total":10.0,
    "runsGreen_total":5.0,
    "runsBlue_total":3.0,
    "runsBlack_total":2.0,
    "elevation_base":2610,
    "elevation_summit":3268,
    "trailMap_image":"images/Oukaimeden.jpeg",
    "total_runs":10.0,
    "runsBlue_percent":30.0,
    "runsGreen_percent":50.0,
    "runsBlack_percent":20.0,
    "vertical_drop":658
  },
  {
    "name":"Skiing Chréa",
    "image_url":"n/a",
    "lat":"36.429363",
    "lng":"2.8833",
    "description":"Morocco is known by exotic-skiing cognoscenti as the best skiing destination in Africa, but the high, snow-catching slopes of the Atlas Mountains extend from Morocco into Algeria as well. It was here, 43 miles south of the capital city of Algiers in the Tell Atlas subrange, that French colonialists established Africa’s first ski area in the 1940s. Sitting at 5,000 feet in what is now Chréa National Park, the Chréa ski area may have only had 295 feet of vertical drop, but the Atlas cedar forest was beautiful, a welcoming Tudor lodge awaited at the base, and every weekend its slopes filled with French skiers and their families.<br><brBut Chréa had a secret. Unbeknownst to the French, the mountain was also a clandestine base for independence fighters who were plotting for their country’s freedom. Their victory came in 1962, when Algeria won its independence. The French promptly left en masse, abandoning their beloved ski area. Algerians, however, quickly learned to love the foreign sport, maintaining the ski area and even installing a four-and-a-half-mile gondola to Chréa from the nearby city of Bilda in 1984.<br><br>Except Chréa’s time as a conflict zone wasn’t over. An Algerian civil war erupted in 1992, and the little ski area became a military base once again, this time housing the radical Armed Islamic Group. When the war ended in 2002, the lodge and lifts had been destroyed. Skiing in Algeria was over, or so it seemed.<br><br>Then the Algerian government and ski community began rebuilding. A rope tow on Chréa’s main run was restored. The rebuilt gondola from Bilda returned to operation in 2009. Locals built handmade tea stands at the base. Local youth signed up for the revived Algerian national race team, and one skier even went to the Vancouver Olympics in 2010. Today, Chréa is back and Algeria is a skiing country once again.",
    "lift_breakdown":{
      "gondolasAndTrams":0,
      "trains":0,
      "chairlifts":0,
      "surface":1
    },
    "lifts_total":"3",
    "runs_total":0.5,
    "runsGreen_total":0.3,
    "runsBlue_total":0.2,
    "runsBlack_total":0.0,
    "elevation_base":212,
    "elevation_summit":1550,
    "trailMap_image":"images/chrea.jpeg",
    "total_runs":0.5,
    "runsBlue_percent":40.0,
    "runsGreen_percent":60.0,
    "runsBlack_percent":0.0,
    "vertical_drop":1338
  },
  {
    "name":"Skiing Afriski Mountain Resort",
    "image_url":"images/afriski.jpeg",
    "lat":"-28.822314",
    "lng":"28.726029",
    "description":"High in the Maluti Mountains of the Kingdom of Lesotho, sits Afriski, one of only two ski resorts in southern Africa (the other, Tiffindell, is in the same mountains, just over the border in South Africa.) The resort summit is about 10,600 feet (3,222 m) above sea level, with a slope running about 1 kilometer. Much of the winter, snow on the ground can be sparse, so snow-making machines fill in the gaps, creating a giant white stripe on the treeless landscape.",
    "lift_breakdown":{
      "gondolasAndTrams":0,
      "trains":0,
      "chairlifts":0,
      "surface":5
    },
    "lifts_total":"2",
    "runs_total":1.8,
    "runsGreen_total":0.2,
    "runsBlue_total":0.6,
    "runsBlack_total":1.0,
    "elevation_base":3030,
    "elevation_summit":3222,
    "trailMap_image":"https://www.skiresort.info/typo3temp/assets/_processed_/13/37/79/92/93d10aa92a.jpg",
    "total_runs":1.8,
    "runsBlue_percent":33.3333333333,
    "runsGreen_percent":11.1111111111,
    "runsBlack_percent":55.5555555556,
    "vertical_drop":192
  },
  {
    "name":"Skiing Tiffindell",
    "image_url":"images/tiff.jpeg",
    "lat":"-30.653165",
    "lng":"27.927203",
    "description":"Tiffindell Ski & Alpine Resort is a fully equipped hospitality centre with over 150 beds.  It is open year round having secure facilities and is available for skiing & snowboarding, team building, corporate, government functions, and big or unusual promotional events. In the warmer months Tiffindell is the hub of the best off-the-beaten-track adventure-lands in South Africa. Tiffindell and Ben McDhui Pass become the focal point for the highest, meanest, gravel passes in the country. 4x4 adventurers, big bikes, MTB, and hikers flock to the area to complete 'South Africas High 5' and 'The Ben 10 Eco challenge. In the winter months of June,July and August, the resort comes alive to the sport of skiing. Skiing is a great family sport, inspiring, healthy, social, character building activity for young children, youth and parents alike. Tiffindell exudes the atmosphere of the best European ski resorts at a fraction of the cost.",
    "lift_breakdown":{
      "gondolasAndTrams":0,
      "trains":0,
      "chairlifts":0,
      "surface":5
    },
    "lifts_total":"5",
    "runs_total":2.4,
    "runsGreen_total":0.6,
    "runsBlue_total":0.8,
    "runsBlack_total":1.0,
    "elevation_base":2700,
    "elevation_summit":2930,
    "trailMap_image":"https://www.snow-forecast.com/pistemaps/Tiffindell_pistemap.jpg?1601557314",
    "total_runs":2.4,
    "runsBlue_percent":33.3333333333,
    "runsGreen_percent":25.0,
    "runsBlack_percent":41.6666666667,
    "vertical_drop":230
  },
  {
    "name":"Skiing Michlifen",
    "image_url":"images/michlifen.jpeg",
    "lat":"33.412469",
    "lng":"-5.080581",
    "description":"The ski resort Michlifen is located in the Meknès-Tafilalet Region (Morocco). For skiing and snowboarding, there are 1 km of slopes available. 2 lifts transport the guests. The winter sports area is situated between the elevations of 1,880 and 2,060 m. ",
    "lift_breakdown":{
      "gondolasAndTrams":0,
      "trains":0,
      "chairlifts":0,
      "surface":2
    },
    "lifts_total":"2",
    "runs_total":1.0,
    "runsGreen_total":0.6,
    "runsBlue_total":0.4,
    "runsBlack_total":0.0,
    "elevation_base":1880,
    "elevation_summit":2060,
    "trailMap_image":"n/a",
    "total_runs":1.0,
    "runsBlue_percent":40.0,
    "runsGreen_percent":60.0,
    "runsBlack_percent":0.0,
    "vertical_drop":180
  },
  {
    "name":"Skiing Ski Egypt",
    "image_url":"images/egypt.png",
    "lat":"29.972115",
    "lng":"31.019308",
    "description":"The ski resort Ski Egypt is located in Egypt. For skiing and snowboarding, there are 0.6 km of slopes available. 1 lift transports the guests. The winter sports area is situated between the elevations of 150 and 180 m. ",
    "lift_breakdown":{
      "gondolasAndTrams":0,
      "trains":0,
      "chairlifts":0,
      "surface":1
    },
    "lifts_total":"1",
    "runs_total":0.6,
    "runsGreen_total":0.5,
    "runsBlue_total":0.0,
    "runsBlack_total":0.1,
    "elevation_base":150,
    "elevation_summit":180,
    "trailMap_image":"n/a",
    "total_runs":0.6,
    "runsBlue_percent":0.0,
    "runsGreen_percent":83.3333333333,
    "runsBlack_percent":16.6666666667,
    "vertical_drop":30
  },
  {
    "name":"Skiing Matroosberg",
    "image_url":"images/matroosberg.jpeg",
    "lat":"-33.377953",
    "lng":"19.67209",
    "description":"Matroosberg is not strictly a ski resort like we would usually recommend, as it is technically private. To ski or board and use the lift systems at Matroosberg, you must be a member of the South African Ski Club. To be part of the ski club you there is a yearly membership fee of around $30, which gives you access all year/ season, which is a bargain- in fact, even just heading there for a couple of days is cheaper than the alps!  The resort is essentially a farm that provides an abundance of adventurous activities all year round, such as abseiling and mountain biking, so the resort’s motto ‘The peak of adventure’ is very true. As a heads up to the skiers thinking of trying Matroosberg, the slopes are catered for snowboarders… but that should never stop anyone from strapping in and pointing downhill! ",
    "lift_breakdown":{
      "gondolasAndTrams":0,
      "trains":0,
      "chairlifts":0,
      "surface":2
    },
    "lifts_total":"2",
    "runs_total":2.0,
    "runsGreen_total":1.0,
    "runsBlue_total":1.0,
    "runsBlack_total":0.0,
    "elevation_base":1794,
    "elevation_summit":2132,
    "trailMap_image":"https://www.skiresort.info/typo3temp/assets/_processed_/fa/a0/04/44/b1842ebc84.jpg",
    "total_runs":2.0,
    "runsBlue_percent":50.0,
    "runsGreen_percent":50.0,
    "runsBlack_percent":0.0,
    "vertical_drop":338
  },
  {
    "name":"Skiing Jbel Hebri",
    "image_url":"images/jbel.jpeg",
    "lat":"33.364912",
    "lng":"-5.141071",
    "description":"Jbel Hebri is a volcanic cone peaking at 2092m of altitude in the Middle Atlas, in Morocco, south east of the city of Azrou. The mount is most known by the moroccans for its snow tracks where skiing and sledding is possible during winter.",
    "lift_breakdown":{
      "gondolasAndTrams":0,
      "trains":0,
      "chairlifts":0,
      "surface":0
    },
    "lifts_total":"1",
    "runs_total":1.0,
    "runsGreen_total":0.0,
    "runsBlue_total":1.0,
    "runsBlack_total":0.0,
    "elevation_base":1950,
    "elevation_summit":2090,
    "trailMap_image":"n/a",
    "total_runs":1.0,
    "runsBlue_percent":100.0,
    "runsGreen_percent":0.0,
    "runsBlack_percent":0.0,
    "vertical_drop":140
  },
  {
    "name":"Skiing Snow City Egypt – Cairo",
    "image_url":"n/a",
    "lat":"30.073483",
    "lng":"31.347156",
    "description":"The ski resort Snow City Egypt – Cairo is located in Egypt. For skiing and snowboarding, there are 0.1 km of slopes available. The winter sports area is situated between the elevations of 89 and 98 m. ",
    "lift_breakdown":{
      "gondolasAndTrams":0,
      "trains":0,
      "chairlifts":0,
      "surface":1
    },
    "lifts_total":"0",
    "runs_total":0.1,
    "runsGreen_total":0.1,
    "runsBlue_total":0.0,
    "runsBlack_total":0.0,
    "elevation_base":89,
    "elevation_summit":98,
    "trailMap_image":"n/a",
    "total_runs":0.1,
    "runsBlue_percent":0.0,
    "runsGreen_percent":100.0,
    "runsBlack_percent":0.0,
    "vertical_drop":9
  }
]